Revit 2026 API

# InstanceNode Methods

---

The InstanceNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RenderNode) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSymbolGeometryId | Gets the SymbolGeometryId associated with the node. |
|  | GetTransform | A transformation matrix associated with the node. (Inherited from GroupNode) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

InstanceNode Class

Autodesk.Revit.DB Namespace